In [2]:
import pandas as pd

In [3]:
path='./data_challenge/train.csv'

In [4]:
df=pd.read_csv(path)

In [5]:
df.tail()

,id,booking_date,origin,destination,dep_date,dep_time,pax,fare_choice
73825,73826,20170619,BOM,CCU,20170623,1905,1,Classic
73826,73827,20170619,DEL,BOM,20170623,1615,1,Classic
73827,73828,20170516,DEL,BOM,20170623,945,3,Deal
73828,73829,20170530,CCU,BOM,20170623,1405,1,Deal
73829,73830,20170620,BOM,MAA,20170623,835,1,Classic

In [6]:
df.origin.unique()

array(['MAA', 'DEL', 'BOM', 'BLR', 'HYD', 'GOI', 'CCU'], dtype=object)

In [7]:
df.destination.unique()

array(['DEL', 'BOM', 'BLR', 'CCU', 'MAA'], dtype=object)

In [18]:
r = requests.get("https://airport.api.aero/airport/v2/distance/AMS/CDG?=&units=km","x-apikey":"d805e84363494ca03b9b52d5a505c4d1")

SyntaxError: invalid syntax (<ipython-input-18-76b4f1822a07>, line 1)

In [8]:
airport_df=pd.read_csv('./data_challenge/aircodes.csv')

In [9]:
airport_df.head(10)

         City Code
0      Mumbai  BOM
1       Delhi  DEL
2         Goa  GOI
3  Hyderabad   HYD
4    Kolkata   CCU
5     Madras   MAA
6   Bangalore  BLR

In [33]:
airport_df=airport_df.drop([0,1],axis=0)

In [34]:
airport_df=airport_df.drop(['Unnamed: 0'],axis=1)

In [35]:
airport_df.columns=airport_df.iloc[0]

In [40]:
airport_df=airport_df.drop([2],axis=0)

In [42]:
airport_df_india=airport_df[(airport_df.Country=='India')]

In [44]:
airport_df_india.to_csv('aircodes.csv')

In [53]:
AIzaSyD9dvdNgWYBjWN7mrIxB6Q2PdxcX69oNxc

NameError: name 'AIzaSyD9dvdNgWYBjWN7mrIxB6Q2PdxcX69oNxc' is not defined

In [14]:
import requests

In [63]:
r = requests.get("https://maps.googleapis.com/maps/api/distancematrix/json?origins=Mumbai&destinations=Bangalore&key=AIzaSyD9dvdNgWYBjWN7mrIxB6Q2PdxcX69oNxc")

In [64]:
r.json()

{'destination_addresses': ['Bengaluru, Karnataka, India'],
 'origin_addresses': ['Mumbai, Maharashtra, India'],
 'rows': [{'elements': [{'distance': {'text': '984 km', 'value': 983906},
     'duration': {'text': '15 hours 13 mins', 'value': 54789},
     'status': 'OK'}]}],
 'status': 'OK'}

In [10]:
cities= list(airport_df.City)

In [11]:
cities

['Mumbai', 'Delhi', 'Goa', 'Hyderabad ', 'Kolkata ', 'Madras ', 'Bangalore']

In [26]:
q=[]

In [27]:
for i in range(0,7):
    for j in range(i+1,7):
        r = requests.get("https://maps.googleapis.com/maps/api/distancematrix/json?origins="+cities[i]+"&destinations="+cities[j]+"&key=AIzaSyD9dvdNgWYBjWN7mrIxB6Q2PdxcX69oNxc")
        q.append([r.json()["rows"][0]["elements"][0]["distance"]["text"],cities[i],cities[j]])

In [16]:
q[6]

['1,901 km', 'Delhi', 'Goa']

In [100]:
q[6][0].json()

{'destination_addresses': ['Goa, India'],
 'origin_addresses': ['Delhi, India'],
 'rows': [{'elements': [{'distance': {'text': '1,901 km', 'value': 1901263},
     'duration': {'text': '1 day 9 hours', 'value': 119782},
     'status': 'OK'}]}],
 'status': 'OK'}

In [95]:
import json

In [116]:
q[6][0].json()["rows"][0]["elements"][0]["distance"]["text"]

'1,901 km'

In [25]:
for x in q:
    print(x)

TypeError: 'NoneType' object is not iterable

In [38]:
df.head()

   id  booking_date origin destination  dep_date  dep_time  pax fare_choice
0   1      20170210    MAA         DEL  20170601       630    2        Deal
1   2      20170527    DEL         BOM  20170601      1745    1     Classic
2   3      20170530    BOM         DEL  20170601       900    1       Saver
3   4      20170530    BOM         BLR  20170601      2130    2     Classic
4   5      20170530    DEL         BOM  20170601      1240    1     Classic

In [39]:
theDF= pd.merge(df,airport_df,left_on='origin',right_on='Code',how='left')

In [40]:
theDF=theDF.drop(['origin','Code'],axis=1)

In [41]:
theDF.rename(columns= {'City':'OriginCity'},inplace=True)

In [42]:
theDF.head()

,id,booking_date,destination,dep_date,dep_time,pax,fare_choice,OriginCity
0,1,20170210,DEL,20170601,630,2,Deal,Madras
1,2,20170527,BOM,20170601,1745,1,Classic,Delhi
2,3,20170530,DEL,20170601,900,1,Saver,Mumbai
3,4,20170530,BLR,20170601,2130,2,Classic,Mumbai
4,5,20170530,BOM,20170601,1240,1,Classic,Delhi

In [45]:
theDF= pd.merge(theDF,airport_df,left_on='destination',right_on='Code',how='left')

In [46]:
theDF=theDF.drop(['destination','Code'],axis=1)

In [47]:
theDF.rename(columns= {'City':'DestinationCity'},inplace=True)

In [48]:
theDF.head(5)

,id,booking_date,dep_date,dep_time,pax,fare_choice,OriginCity,DestinationCity
0,1,20170210,20170601,630,2,Deal,Madras,Delhi
1,2,20170527,20170601,1745,1,Classic,Delhi,Mumbai
2,3,20170530,20170601,900,1,Saver,Mumbai,Delhi
3,4,20170530,20170601,2130,2,Classic,Mumbai,Bangalore
4,5,20170530,20170601,1240,1,Classic,Delhi,Mumbai

In [191]:
pd.DataFrame(q)

           0           1           2
0   1,421 km      Mumbai       Delhi
1     587 km      Mumbai         Goa
2     711 km      Mumbai  Hyderabad
3   2,056 km      Mumbai    Kolkata
4   1,337 km      Mumbai     Madras
5     984 km      Mumbai   Bangalore
6   1,901 km       Delhi         Goa
7   1,578 km       Delhi  Hyderabad
8   1,498 km       Delhi    Kolkata
9   2,203 km       Delhi     Madras
10  2,167 km       Delhi   Bangalore
11    637 km         Goa  Hyderabad
12  2,122 km         Goa    Kolkata
13    911 km         Goa     Madras
14    558 km         Goa   Bangalore
15  1,492 km  Hyderabad     Kolkata
16    628 km  Hyderabad      Madras
17    576 km  Hyderabad    Bangalore
18  1,673 km    Kolkata      Madras
19  1,862 km    Kolkata    Bangalore
20    348 km     Madras    Bangalore

In [17]:
q

[['1,421 km', 'Mumbai', 'Delhi'],
 ['587 km', 'Mumbai', 'Goa'],
 ['711 km', 'Mumbai', 'Hyderabad '],
 ['2,056 km', 'Mumbai', 'Kolkata '],
 ['1,337 km', 'Mumbai', 'Madras '],
 ['984 km', 'Mumbai', 'Bangalore'],
 ['1,901 km', 'Delhi', 'Goa'],
 ['1,578 km', 'Delhi', 'Hyderabad '],
 ['1,498 km', 'Delhi', 'Kolkata '],
 ['2,203 km', 'Delhi', 'Madras '],
 ['2,167 km', 'Delhi', 'Bangalore'],
 ['637 km', 'Goa', 'Hyderabad '],
 ['2,122 km', 'Goa', 'Kolkata '],
 ['911 km', 'Goa', 'Madras '],
 ['558 km', 'Goa', 'Bangalore'],
 ['1,492 km', 'Hyderabad ', 'Kolkata '],
 ['628 km', 'Hyderabad ', 'Madras '],
 ['576 km', 'Hyderabad ', 'Bangalore'],
 ['1,673 km', 'Kolkata ', 'Madras '],
 ['1,862 km', 'Kolkata ', 'Bangalore'],
 ['348 km', 'Madras ', 'Bangalore']]

In [18]:
p=[]
for x in q:
    p.append([x[0],x[2],x[1]])

In [28]:
q=q+p

In [31]:
cities_matrix=pd.DataFrame(q)

In [35]:
cities_matrix.columns=['Distance','OriginCity','DestinationCity']

In [36]:
cities_matrix

    Distance  OriginCity DestinationCity
0   1,421 km      Mumbai           Delhi
1     587 km      Mumbai             Goa
2     711 km      Mumbai      Hyderabad
3   2,056 km      Mumbai        Kolkata
4   1,337 km      Mumbai         Madras
5     984 km      Mumbai       Bangalore
6   1,901 km       Delhi             Goa
7   1,578 km       Delhi      Hyderabad
8   1,498 km       Delhi        Kolkata
9   2,203 km       Delhi         Madras
10  2,167 km       Delhi       Bangalore
11    637 km         Goa      Hyderabad
12  2,122 km         Goa        Kolkata
13    911 km         Goa         Madras
14    558 km         Goa       Bangalore
15  1,492 km  Hyderabad         Kolkata
16    628 km  Hyderabad          Madras
17    576 km  Hyderabad        Bangalore
18  1,673 km    Kolkata          Madras
19  1,862 km    Kolkata        Bangalore
20    348 km     Madras        Bangalore
21  1,421 km       Delhi          Mumbai
22    587 km         Goa          Mumbai
23    711 km  Hyderabad           Mumbai
24  2,056 km    Kolkata           Mumbai
25  1,337 km     Madras           Mumbai
26    984 km   Bangalore          Mumbai
27  1,901 km         Goa           Delhi
28  1,578 km  Hyderabad            Delhi
29  1,498 km    Kolkata            Delhi
30  2,203 km     Madras            Delhi
31  2,167 km   Bangalore           Delhi
32    637 km  Hyderabad              Goa
33  2,122 km    Kolkata              Goa
34    911 km     Madras              Goa
35    558 km   Bangalore             Goa
36  1,492 km    Kolkata       Hyderabad
37    628 km     Madras       Hyderabad
38    576 km   Bangalore      Hyderabad
39  1,673 km     Madras         Kolkata
40  1,862 km   Bangalore        Kolkata
41    348 km   Bangalore         Madras

In [49]:
dist_DF= pd.merge(theDF,cities_matrix,on=['OriginCity','DestinationCity'],how='left')

In [50]:
dist_DF.head(5)

,id,booking_date,dep_date,dep_time,pax,fare_choice,OriginCity,DestinationCity,Distance
0,1,20170210,20170601,630,2,Deal,Madras,Delhi,"2,203 km"
1,2,20170527,20170601,1745,1,Classic,Delhi,Mumbai,"1,421 km"
2,3,20170530,20170601,900,1,Saver,Mumbai,Delhi,"1,421 km"
3,4,20170530,20170601,2130,2,Classic,Mumbai,Bangalore,984 km
4,5,20170530,20170601,1240,1,Classic,Delhi,Mumbai,"1,421 km"

In [52]:
import re

In [58]:
dist_DF['DistanceNumeric']=dist_DF['Distance'].apply(lambda x:(int(re.sub('[,(km)]','',x))))

In [63]:
dist_DF.head(5)

,id,booking_date,dep_date,dep_time,pax,fare_choice,OriginCity,DestinationCity,DistanceNumeric
0,1,20170210,20170601,630,2,Deal,Madras,Delhi,2203
1,2,20170527,20170601,1745,1,Classic,Delhi,Mumbai,1421
2,3,20170530,20170601,900,1,Saver,Mumbai,Delhi,1421
3,4,20170530,20170601,2130,2,Classic,Mumbai,Bangalore,984
4,5,20170530,20170601,1240,1,Classic,Delhi,Mumbai,1421

In [62]:
dist_DF=dist_DF.drop(['Distance'],axis=1)

In [96]:
(dist_DF['booking_date'][0][1])

IndexError: invalid index to scalar variable.

In [109]:
dist_DF.head(1)

,id,booking_date,dep_date,dep_time,pax,fare_choice,OriginCity,DestinationCity,DistanceNumeric,DateDiff
0,1,2017-02-10,2017-06-01,630,2,Deal,Madras,Delhi,2203,111

In [100]:
dist_DF['dep_date']=dist_DF['dep_date'].apply(lambda x:datetime.date(int(str(x)[0:4]),int(str(x)[4:6]),int(str(x)[6:8])))

In [99]:
dist_DF['booking_date']=dist_DF['booking_date'].apply(lambda x:datetime.date(int(str(x)[0:4]),int(str(x)[4:6]),int(str(x)[6:8])))

In [106]:
dist_DF['DateDiff']=dist_DF['dep_date']-dist_DF['booking_date']

In [108]:
dist_DF['DateDiff']=dist_DF['DateDiff'].apply(lambda x: x.days)

In [64]:
import datetime

In [65]:
k='20170210'

In [66]:
k[0:4]

'2017'

In [67]:
k[4:6]

'02'

In [68]:
k[6:8]

'10'

In [70]:
mydate=datetime.date(int(k[0:4]),int(k[4:6]),int(k[6:8]))

In [72]:
diff=mydate-datetime.date(2017,2,1)

In [77]:
type(diff.days)

int

In [85]:
dist_DF[['booking_date','dep_date']]

       booking_date  dep_date
0          20170210  20170601
1          20170527  20170601
2          20170530  20170601
3          20170530  20170601
4          20170530  20170601
5          20170530  20170601
6          20170530  20170601
7          20170531  20170601
8          20170531  20170601
9          20170511  20170601
10         20170601  20170601
11         20170601  20170601
12         20170428  20170601
13         20170326  20170601
14         20170310  20170601
15         20170529  20170601
16         20170530  20170601
17         20170530  20170601
18         20170530  20170601
19         20170503  20170601
20         20170531  20170601
21         20170524  20170601
22         20170531  20170601
23         20170531  20170601
24         20170601  20170601
25         20170601  20170601
26         20170601  20170601
27         20170526  20170601
28         20170526  20170601
29         20170526  20170601
...             ...       ...
73800      20170608  20170623
73801      20170505  20170623
73802      20170526  20170623
73803      20170615  20170623
73804      20170623  20170623
73805      20170623  20170623
73806      20170623  20170623
73807      20170527  20170623
73808      20170619  20170623
73809      20170502  20170623
73810      20170322  20170623
73811      20170614  20170623
73812      20170622  20170623
73813      20170622  20170623
73814      20170622  20170623
73815      20170622  20170623
73816      20170622  20170623
73817      20170602  20170623
73818      20170616  20170623
73819      20170616  20170623
73820      20170616  20170623
73821      20170617  20170623
73822      20170520  20170623
73823      20170528  20170623
73824      20170618  20170623
73825      20170619  20170623
73826      20170619  20170623
73827      20170516  20170623
73828      20170530  20170623
73829      20170620  20170623

[73830 rows x 2 columns]

In [111]:
dist_DF.to_csv('feature_set_refined.csv')

In [1]:
from sklearn.cross_validation import train_test_split

/home/chiralcarbon/.local/lib/python3.5/site-packages/sklearn/cross_validation.py:41: DeprecationWarning: This module was deprecated in version 0.18 in favor of the model_selection module into which all the refactored classes and functions are moved. Also note that the interface of the new CV iterators are different from that of this module. This module will be removed in 0.20.
  "This module will be removed in 0.20.", DeprecationWarning)